export const DATA = {
  "roads": [
    {
      "id": "olympic",
      "name": "올림픽대로",
      "segments": [
        {
          "name": "행주대교~방화대교",
          "centerline": [
            [
              37.6007,
              126.8112
            ],
            [
              37.5728,
              126.8289
            ]
          ]
        },
        {
          "name": "방화대교~궁산",
          "centerline": [
            [
              37.5728,
              126.8289
            ],
            [
              37.5605,
              126.8549
            ]
          ]
        },
        {
          "name": "궁산~가양대교",
          "centerline": [
            [
              37.5605,
              126.8549
            ],
            [
              37.5589,
              126.8748
            ]
          ]
        },
        {
          "name": "가양대교~양화대교",
          "centerline": [
            [
              37.5589,
              126.8748
            ],
            [
              37.5412,
              126.9022
            ]
          ]
        },
        {
          "name": "양화대교~여의2교",
          "centerline": [
            [
              37.5412,
              126.9022
            ],
            [
              37.5265,
              126.9245
            ]
          ]
        },
        {
          "name": "여의2교~여의교",
          "centerline": [
            [
              37.5265,
              126.9245
            ],
            [
              37.5206,
              126.9435
            ]
          ]
        },
        {
          "name": "여의교~노량대교",
          "centerline": [
            [
              37.5206,
              126.9435
            ],
            [
              37.5127,
              126.9576
            ]
          ]
        },
        {
          "name": "한강대교~동작대교",
          "centerline": [
            [
              37.5176,
              126.9597
            ],
            [
              37.5082,
              126.9822
            ]
          ]
        },
        {
          "name": "동작대교~반포대교",
          "centerline": [
            [
              37.5082,
              126.9822
            ],
            [
              37.5127,
              126.9968
            ]
          ]
        },
        {
          "name": "반포대교~한남대교",
          "centerline": [
            [
              37.5127,
              126.9968
            ],
            [
              37.5247,
              127.0143
            ]
          ]
        },
        {
          "name": "한남대교~동호대교",
          "centerline": [
            [
              37.5247,
              127.0143
            ],
            [
              37.5362,
              127.0302
            ]
          ]
        },
        {
          "name": "동호대교~성수대교",
          "centerline": [
            [
              37.5362,
              127.0302
            ],
            [
              37.5388,
              127.0465
            ]
          ]
        },
        {
          "name": "성수대교~청담대교",
          "centerline": [
            [
              37.5388,
              127.0465
            ],
            [
              37.5241,
              127.0649
            ]
          ]
        },
        {
          "name": "청담대교~강일IC",
          "centerline": [
            [
              37.5241,
              127.0649
            ],
            [
              37.5211,
              127.1012
            ],
            [
              37.5576,
              127.1707
            ]
          ]
        }
      ]
    },
    {
      "id": "gangbyeonbuk",
      "name": "강변북로",
      "segments": [
        {
          "name": "가양대교~성산대교",
          "centerline": [
            [
              37.5711,
              126.8629
            ],
            [
              37.5527,
              126.8912
            ]
          ]
        },
        {
          "name": "성산대교~양화대교",
          "centerline": [
            [
              37.5527,
              126.8912
            ],
            [
              37.5393,
              126.9022
            ]
          ]
        },
        {
          "name": "양화대교~서강대교",
          "centerline": [
            [
              37.5393,
              126.9022
            ],
            [
              37.5337,
              126.9255
            ]
          ]
        },
        {
          "name": "서강대교~원효대교",
          "centerline": [
            [
              37.5337,
              126.9255
            ],
            [
              37.527,
              126.9486
            ]
          ]
        },
        {
          "name": "원효대교~한강대교",
          "centerline": [
            [
              37.527,
              126.9486
            ],
            [
              37.5187,
              126.9618
            ]
          ]
        },
        {
          "name": "한강대교~동작대교",
          "centerline": [
            [
              37.5187,
              126.9618
            ],
            [
              37.5112,
              126.9816
            ]
          ]
        },
        {
          "name": "동작대교~반포대교",
          "centerline": [
            [
              37.5112,
              126.9816
            ],
            [
              37.5134,
              126.9966
            ]
          ]
        },
        {
          "name": "반포대교~한남대교",
          "centerline": [
            [
              37.5134,
              126.9966
            ],
            [
              37.5249,
              127.0138
            ]
          ]
        },
        {
          "name": "한남대교~동호대교",
          "centerline": [
            [
              37.5249,
              127.0138
            ],
            [
              37.536,
              127.0216
            ]
          ]
        },
        {
          "name": "동호대교~성수대교",
          "centerline": [
            [
              37.536,
              127.0216
            ],
            [
              37.5391,
              127.0347
            ]
          ]
        },
        {
          "name": "성수대교~청담대교",
          "centerline": [
            [
              37.5391,
              127.0347
            ],
            [
              37.5237,
              127.0648
            ]
          ]
        },
        {
          "name": "청담대교~잠실대교",
          "centerline": [
            [
              37.5237,
              127.0648
            ],
            [
              37.5208,
              127.0917
            ]
          ]
        },
        {
          "name": "잠실대교~올림픽대교",
          "centerline": [
            [
              37.5208,
              127.0917
            ],
            [
              37.5334,
              127.1043
            ]
          ]
        },
        {
          "name": "올림픽대교~천호대교",
          "centerline": [
            [
              37.5334,
              127.1043
            ],
            [
              37.5421,
              127.1138
            ]
          ]
        },
        {
          "name": "천호대교~암사대교",
          "centerline": [
            [
              37.5421,
              127.1138
            ],
            [
              37.5522,
              127.1295
            ]
          ]
        }
      ]
    },
    {
      "id": "gyeongbu",
      "name": "경부고속도로",
      "segments": [
        {
          "name": "한남IC~반포IC",
          "centerline": [
            [
              37.524,
              127.0176
            ],
            [
              37.5045,
              127.0098
            ]
          ]
        },
        {
          "name": "반포IC~서초IC",
          "centerline": [
            [
              37.5045,
              127.0098
            ],
            [
              37.4833,
              127.021
            ]
          ]
        },
        {
          "name": "서초IC~양재IC",
          "centerline": [
            [
              37.4833,
              127.021
            ],
            [
              37.4625,
              127.0395
            ]
          ]
        }
      ]
    },
    {
      "id": "seobu",
      "name": "서부간선도로",
      "segments": [
        {
          "name": "성산대교~오목교",
          "centerline": [
            [
              37.5528,
              126.8912
            ],
            [
              37.5252,
              126.878
            ]
          ]
        },
        {
          "name": "오목교~고척교",
          "centerline": [
            [
              37.5252,
              126.878
            ],
            [
              37.4978,
              126.8715
            ]
          ]
        },
        {
          "name": "고척교~철산교",
          "centerline": [
            [
              37.4978,
              126.8715
            ],
            [
              37.4744,
              126.8695
            ]
          ]
        },
        {
          "name": "철산교~금천교",
          "centerline": [
            [
              37.4744,
              126.8695
            ],
            [
              37.452,
              126.883
            ]
          ]
        }
      ]
    },
    {
      "id": "gukhoe",
      "name": "국회대로",
      "segments": [
        {
          "name": "신월IC~화곡고가도로",
          "centerline": [
            [
              37.5275,
              126.8332
            ],
            [
              37.5328,
              126.8513
            ]
          ]
        },
        {
          "name": "화곡고가도로~홍익병원사거리",
          "centerline": [
            [
              37.5328,
              126.8513
            ],
            [
              37.5308,
              126.8719
            ]
          ]
        },
        {
          "name": "홍익병원사거리~청소년수련관교차로",
          "centerline": [
            [
              37.5308,
              126.8719
            ],
            [
              37.5279,
              126.8868
            ]
          ]
        },
        {
          "name": "양천우체국교차로~목동교",
          "centerline": [
            [
              37.5279,
              126.8868
            ],
            [
              37.5245,
              126.9008
            ]
          ]
        }
      ]
    },
    {
      "id": "dongbu",
      "name": "동부간선도로",
      "segments": [
        {
          "name": "용비교~군자교",
          "centerline": [
            [
              37.5542,
              127.041
            ],
            [
              37.5686,
              127.0632
            ]
          ]
        },
        {
          "name": "군자교~중랑교",
          "centerline": [
            [
              37.5686,
              127.0632
            ],
            [
              37.5942,
              127.0715
            ]
          ]
        },
        {
          "name": "중랑교~한천교",
          "centerline": [
            [
              37.5942,
              127.0715
            ],
            [
              37.6184,
              127.0702
            ]
          ]
        },
        {
          "name": "한천교~창동교",
          "centerline": [
            [
              37.6184,
              127.0702
            ],
            [
              37.6549,
              127.0568
            ]
          ]
        },
        {
          "name": "창동교~상도교",
          "centerline": [
            [
              37.6549,
              127.0568
            ],
            [
              37.6858,
              127.0477
            ]
          ]
        }
      ]
    },
    {
      "id": "bukbu",
      "name": "북부간선도로",
      "segments": [
        {
          "name": "화랑대사거리~봉화교",
          "centerline": [
            [
              37.6216,
              127.0838
            ],
            [
              37.5987,
              127.107
            ]
          ]
        }
      ]
    },
    {
      "id": "naebu",
      "name": "내부순환로",
      "segments": [
        {
          "name": "내부순환로 관리구간",
          "centerline": [
            [
              37.5678,
              126.914
            ],
            [
              37.5908,
              126.962
            ],
            [
              37.5848,
              127.0432
            ]
          ]
        }
      ]
    },
    {
      "id": "yangjae",
      "name": "양재대로/언주로",
      "segments": [
        {
          "name": "염곡사거리~내곡터널관리사무소",
          "centerline": [
            [
              37.4624,
              127.0431
            ],
            [
              37.4702,
              127.063
            ],
            [
              37.449,
              127.0905
            ]
          ]
        }
      ]
    }
  ],
  "places": {
    "오목교역": [
      37.5245,
      126.875
    ],
    "오목교": [
      37.5252,
      126.878
    ],
    "목동교": [
      37.5245,
      126.9008
    ],
    "성산대교": [
      37.5527,
      126.8912
    ],
    "가양대교": [
      37.5711,
      126.8629
    ],
    "청담대교": [
      37.5237,
      127.0648
    ],
    "한남IC": [
      37.524,
      127.0176
    ],
    "양재IC": [
      37.4625,
      127.0395
    ],
    "서울숲": [
      37.5444,
      127.0374
    ],
    "강일IC": [
      37.5576,
      127.1707
    ],
    "신월IC": [
      37.5275,
      126.8332
    ],
    "고척교": [
      37.4978,
      126.8715
    ],
    "금천교": [
      37.452,
      126.883
    ],
    "군자교": [
      37.5686,
      127.0632
    ],
    "창동교": [
      37.6549,
      127.0568
    ],
    "상도교": [
      37.6858,
      127.0477
    ]
  }
};
